tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "python@3.10"
brew "awscli"
brew "bash"
brew "bat"
brew "black"
brew "ruby"
brew "cocoapods"
brew "cookiecutter"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli", link: false
brew "kops"
brew "mas"
brew "mercurial"
brew "nghttp2"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk"
brew "pipenv"
brew "poetry"
brew "pre-commit"
brew "pyenv-virtualenv"
brew "tcl-tk"
brew "python@3.8"  # required by google-cloud-sdk
brew "python@3.9"
brew "ripgrep"
brew "ruby@2.5"
brew "ruby@2.7"
brew "sops"
brew "sphinx-doc"
brew "svgo"
brew "terraform"
brew "tmux"
brew "tor"
brew "virtualenv"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "heroku/brew/heroku"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "android-file-transfer"
cask "android-platform-tools"
cask "betterzip"
cask "docker"
cask "firefox"
cask "fluor"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "macs-fan-control"
cask "postgres-unofficial"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "sketch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "zoom"
mas "Battery Monitor", id: 836505650
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "NordLayer", id: 1488888843
mas "Xcode", id: 497799835
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
