tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bash"
brew "bat"
brew "git"
brew "gnu-getopt"
brew "goaccess"
brew "jq"
brew "kubernetes-helm"
brew "mas"
brew "python@2"
brew "mercurial"
brew "node"
brew "python"
brew "pipenv"
brew "ripgrep"
brew "sops"
brew "tmux"
brew "tor"
brew "yarn"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "1password-cli"
cask "android-file-transfer"
cask "betterzip"
cask "cheatsheet"
cask "docker"
cask "firefox"
cask "fluor"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "harvest"
cask "iterm2"
cask "java"
cask "postman"
cask "pycharm"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "sketch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "zoomus"
mas "com.apple.dt.Xcode", id: 497799835
mas "com.fiplab.clipboard", id: 595191960
